[
  {
    "id": "A1",
    "part": "A",
    "text": "The voltage-gated K+ channel inactivation state is responsible for the absolute refractory period.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The voltage-gated Na+ inactivation state is responsible for the absolute refractory period. K+ voltage-gated channel does not go through any inactivation state."
  },
  {
    "id": "A2",
    "part": "A",
    "text": "The voltage-gated Na+ channel is responsible for the depolarization phase of the action potential.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A3",
    "part": "A",
    "text": "When temporal summation occurs, spatial summation cannot.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Temporal and spatial summation can occur simultaneously."
  },
  {
    "id": "A4",
    "part": "A",
    "text": "The firing rate influences the amplitude of the resulting action potential in the post-synaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It can affect the temporal summation and therefore the amplitude of the post-synaptic potentials, not of the action potential."
  },
  {
    "id": "A5",
    "part": "A",
    "text": "The frontal lobe houses the primary motor function.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A6",
    "part": "A",
    "text": "In the brain primary somatosensory cortex (Penfield homunculus) the extension of the cortical region which maps a specific body region is proportional to that body region's volume.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The extension of the cortical region which maps a specific body region is proportional to the number of receptors, not to the body region's volume."
  },
  {
    "id": "A7",
    "part": "A",
    "text": "The short-term synaptic plasticity involves a structural change in the post-synaptic membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It involves only functional changes."
  },
  {
    "id": "A8",
    "part": "A",
    "text": "The brain operates at the temporal scale of milliseconds.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A9",
    "part": "A",
    "text": "The neurons' spatial orientation affects the amplitude of EEG signals",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A10",
    "part": "A",
    "text": "The synchronicity of the neural activity affects the amplitude of EEG signals.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A11",
    "part": "A",
    "text": "Scalp EEG is mainly produced by deep (subcortical) regions.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It is mainly produced by cortical regions."
  },
  {
    "id": "A12",
    "part": "A",
    "text": "The electrical variation of the membrane potential that mainly contributes to EEG is the action potential.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The synchronous variations of post-synaptic potentials (and their extracellular counterpart) are the main contributors to EEG signals."
  },
  {
    "id": "A13",
    "part": "A",
    "text": "A neuron's firing rate tuning curve for movement direction shows (panel A) the spike trains obtained - for different trials - from a neuron of the primary motor cortex in correspondence to an arm movement, and (panel B) the firing rate f of the same neuron as a function of the angle s of the same movement direction. When the firing rate is 55 Hz, I can infer which movement direction produced that response.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": "Yes, because there's a unique value of s that can produce a neuronal response with that firing rate."
  },
  {
    "id": "A14",
    "part": "A",
    "text": "In reference to the neuron's firing rate tuning curve for movement direction: from the curve I can conclude that this neuron is tuned to be more active in correspondence to a specific movement direction.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A15",
    "part": "A",
    "text": "In reference to the neuron's firing rate tuning curve for movement direction: the firing rate f in panel B was computed as the average of the neural response function across trials.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A16",
    "part": "A",
    "text": "If Cxy(f) is the Ordinary Coherence between x and y, Cxy(f)=Cyx(f).",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A17",
    "part": "A",
    "text": "Given the Granger Index Gxy between two time series x and y, a negative value of Gxy means an inverse precedence between the two time series.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "A negative value of Gxy means that the residual of the bivariate model is higher than in the simple model, which is probably due to an incorrect modeling."
  },
  {
    "id": "A18",
    "part": "A",
    "text": "In the event of data paucity, the Partial Directed Coherence (PDC) is the most accurate estimator of causality in the statistical sense.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "When we have a limited amount of data, PDC returns inaccurate results due to the low ratio between data samples and model parameters."
  },
  {
    "id": "A19",
    "part": "A",
    "text": "In a directed graph, all indices are doubled with respect to a corresponding undirected one (i.e., the graph where all the directions have been removed).",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "There is no such correspondence between the indices of a directed graph and those of its corresponding undirected one."
  },
  {
    "id": "A20",
    "part": "A",
    "text": "Random networks have a smaller Local Efficiency than regular (lattice) networks.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A21",
    "part": "A",
    "text": "In a graph, the minimum Divisibility is equal to zero.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "According to the most used normalization, the minimum Divisibility is equal to 0.5. More generally, even with different choices of the term k, D can never be equal to zero."
  },
  {
    "id": "A22",
    "part": "A",
    "text": "Divisibility and Modularity are measures of segregation of a network.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A23",
    "part": "A",
    "text": "Regular networks have a smaller Global Efficiency than random networks.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A24",
    "part": "A",
    "text": "Modularity values belong to the interval [0,1]",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Modularity can take positive or negative values."
  },
  {
    "id": "A25",
    "part": "A",
    "text": "An IPSP consists of a depolarization of the post-synaptic cell membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Being inhibitory, it consists of a hyperpolarization of the membrane."
  },
  {
    "id": "A26",
    "part": "A",
    "text": "The inactivation of the voltage-gated Na+ channel is responsible for the absolute refractory period.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A27",
    "part": "A",
    "text": "The most informative parameter of the spike train in output to a neuronal cell is the amplitude of the spikes.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The amplitude of all the spikes is the same, so this is not an informative parameter."
  },
  {
    "id": "A28",
    "part": "A",
    "text": "The firing rate of the pre-synaptic neuron influences the temporal summation of the PSPs in the post-synaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A29",
    "part": "A",
    "text": "The frontal lobe houses the primary visual function.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The primary visual cortex is located in the occipital lobe."
  },
  {
    "id": "A30",
    "part": "A",
    "text": "In the primary motor cortex (Penfield homunculus) the extension of the cortical region which controls a specific body region is proportional to that body region's volume.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The extension of the cortical region which controls a specific body region is proportional to the number of motor nerves, not to the body region's volume."
  },
  {
    "id": "A31",
    "part": "A",
    "text": "To record in vivo measures of the membrane potential over the axon of a single neural cell, you will use extracellular measures.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A32",
    "part": "A",
    "text": "The EEG signal is mainly generated by action potentials.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It is mainly generated by post-synaptic potentials."
  },
  {
    "id": "A33",
    "part": "A",
    "text": "A neuron's firing rate tuning curve for retinal disparity shows (panel B) the firing rate f of a neuron in the primary visual cortex as a function of the retinal disparity angle s (panel A). From the figure, we can infer that the neuron responds mainly to positive s (far-tuned neuron).",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A34",
    "part": "A",
    "text": "In reference to the neuron's firing rate tuning curve for retinal disparity: from the curve, if the retinal disparity is equal to -0.5, I can infer which firing rate will be produced by the neuron",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": "It will be equal to 0"
  },
  {
    "id": "A35",
    "part": "A",
    "text": "In reference to the neuron's firing rate tuning curve for retinal disparity: from the curve, if the neuron firing rate is equal to 0 Hz I can exactly infer which retinal disparity produced that response",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The retinal disparity in degrees cannot be inferred when the firing rate is equal to 0, because a large range of negative values would produce the same response."
  },
  {
    "id": "A36",
    "part": "A",
    "text": "To record in vitro measures of the membrane potential over the dendrites of a neural cell, you will use extracellular measures",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Extracellular measures are able to capture only the sequence of APs, not he E/IPSPs that occur over the dendrites. To this purpose, we will use intracellular recordings."
  },
  {
    "id": "A37",
    "part": "A",
    "text": "The part of the pyramidal neuron that acts as a current dipole is the axon",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It's the dendritic tree."
  },
  {
    "id": "A38",
    "part": "A",
    "text": "A neuron's firing rate distribution for visual motion direction shows the firing rate distribution, obtained for a neuron of the primary visual cortex in response to the motion direction of dots on the screen in two possible directions (+ and -) and with different levels of coherence between the dots. Discriminability d' when the coherence=3.2% is higher than when it's =12.8%.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The discriminability d' is higher for higher values of the coherence level."
  },
  {
    "id": "A39",
    "part": "A",
    "text": "In reference to the neuron's firing rate distribution for visual motion direction: among the two distributions (r, or r-), r, is the one affected by the coherence level",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A40",
    "part": "A",
    "text": "The normalized Partial Directed Coherence E[0, 1]",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A41",
    "part": "A",
    "text": "The Granger Test is more suitable than the Ordinary Coherence to obtain a spectral measure",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The Granger Test is not a spectral measure."
  },
  {
    "id": "A42",
    "part": "A",
    "text": "If Cxy(f) is the ordinary coherence between x and y, Cxy(f)=Cyx(f)",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A43",
    "part": "A",
    "text": "The difference between the Wiener's and Granger's definitions of causality in the statistical sense is that Granger indicated a modeling framework to be used to test causality",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A44",
    "part": "A",
    "text": "Regular networks have a smaller Global Efficiency than random networks",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A45",
    "part": "A",
    "text": "Regular networks have a smaller Local Efficiency than random networks",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "They have a larger Local Efficiency."
  },
  {
    "id": "A46",
    "part": "A",
    "text": "Undirected graphs produce symmetrical adjacency matrices",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A47",
    "part": "A",
    "text": "Given the Granger Index Gxy between two time series x and y, a negative value of Gx->y means an inverse precedence between the two time series.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "A negative value of Gxy means that the residual of the bivariate model is higher than in the simple model, which is probably due to an incorrect modeling."
  },
  {
    "id": "A48",
    "part": "A",
    "text": "Using Partial Directed Coherence completely solves the problem of the hidden (common) source",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It can mitigate the problem, but if a source is not accessible (e.g. because of limitations of the acquisition method) even PDC cannot remove the resulting spurious connections."
  },
  {
    "id": "A49",
    "part": "A",
    "text": "In the Nernst equation for the electrochemical equilibrium there is a term referred to diffusional forces and a term referred to electrical forces.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A50",
    "part": "A",
    "text": "Given that at a certain temperature T the Cl- equilibrium potential is equal to -80 mV, and the membrane potential is equal to -70 mV, the Cl- net current will be a depolarizing one.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "If the ion equilibrium potential is more negative than the membrane potential, the ion net current will be a hyperpolarizing one."
  },
  {
    "id": "A51",
    "part": "A",
    "text": "The temporal summation of PSPs does not depend on the temporal distance between subsequent action potentials in the presynaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The temporal summation occurs when the presynaptic neuron fires multiple times in close succession."
  },
  {
    "id": "A52",
    "part": "A",
    "text": "A hyperpolarization with respect to the resting membrane potential can cause the generation of an action potential.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The generation of an action potential is caused by a depolarization of the neuronal membrane."
  },
  {
    "id": "A53",
    "part": "A",
    "text": "The motor homunculus is located in the frontal lobe.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A54",
    "part": "A",
    "text": "The short-term synaptic plasticity can involve a structural change in the post-synaptic membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Structural changes in the post-synaptic membrane occur with long-term plasticity."
  },
  {
    "id": "A55",
    "part": "A",
    "text": "To measure the membrane potential over the soma of a neural cell in vitro, the correct procedure is to record extracellular measures.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "To measure the membrane potential we need intracellular recordings, that can be more easily performed in vitro and on large portions of the cell, like the soma."
  },
  {
    "id": "A56",
    "part": "A",
    "text": "In a cortical pyramidal neuron, thalamo-cortical synapses are located in the apical portion of its dendritic tree.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "They are located in the basal part of the dendritic tree."
  },
  {
    "id": "A57",
    "part": "A",
    "text": "Radially symmetric neurons produce a closed field and therefore do not significantly contribute to scalp EEG.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A58",
    "part": "A",
    "text": "The voltage-gated K+ channel inactivation state is responsible for the absolute refractory period.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The voltage-gated Na+ inactivation state is responsible for the absolute refractory period. K+ voltage-gated channel does not go through any inactivation state."
  },
  {
    "id": "A59",
    "part": "A",
    "text": "The firing rate influences the amplitude of the resulting action potential in the post-synaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It can affect the temporal summation and therefore the amplitude of the post-synaptic potentials, not of the action potential."
  },
  {
    "id": "A60",
    "part": "A",
    "text": "Temporal and spatial summation can occur simultaneously.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A61",
    "part": "A",
    "text": "The brain operates at the temporal scale of milliseconds.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A62",
    "part": "A",
    "text": "The frontal lobe houses the primary visual function.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The primary visual cortex is located in the occipital lobe."
  },
  {
    "id": "A63",
    "part": "A",
    "text": "The synchronicity of the neural activity affects the amplitude of EEG signals.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A64",
    "part": "A",
    "text": "The neurons' spatial orientation affects the amplitude of EEG signals",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A65",
    "part": "A",
    "text": "The short-term synaptic plasticity involves a structural change in the post-synaptic membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The short-term synaptic plasticity only involves functional changes (not structural ones)"
  },
  {
    "id": "A66",
    "part": "A",
    "text": "Scalp EEG is mainly produced by deep (subcortical) regions.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It is mainly produced by cortical regions."
  },
  {
    "id": "A67",
    "part": "A",
    "text": "The part of the pyramidal neuron that acts as a current dipole is the axon",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It's the dendritic tree."
  },
  {
    "id": "A68",
    "part": "A",
    "text": "An IPSP consists of a depolarization of the post-synaptic cell membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Being inhibitory, it consists of a hyperpolarization of the membrane."
  },
  {
    "id": "A69",
    "part": "A",
    "text": "The voltage-gated Na+ channel is responsible for the absolute refractory period.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A70",
    "part": "A",
    "text": "The most informative parameter of the spike train in output to a neuronal cell is the amplitude of the spikes.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The amplitude of all the spikes is the same, so this is not an informative parameter."
  },
  {
    "id": "A71",
    "part": "A",
    "text": "The firing rate of the pre-synaptic neuron influences the temporal summation of the PSPs in the post-synaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A72",
    "part": "A",
    "text": "The frontal lobe houses the primary visual function.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The primary visual cortex is located in the occipital lobe."
  },
  {
    "id": "A73",
    "part": "A",
    "text": "In the brain primary motor cortex (Penfield homunculus) the extension of the cortical region which controls a specific body region is proportional to that body region's volume.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The extension of the cortical region which controls a specific body region is proportional to the number of motor nerves, not to the body region's volume."
  },
  {
    "id": "A74",
    "part": "A",
    "text": "The short-term synaptic plasticity involves an irreversible change in the post-synaptic membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The short-term changes are temporary."
  },
  {
    "id": "A75",
    "part": "A",
    "text": "To record in vivo measures of the membrane potential over the axon of a single neural cell, you will use extracellular measures.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A76",
    "part": "A",
    "text": "The EEG signal is mainly generated by action potentials.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It is mainly generated by post-synaptic potentials."
  },
  {
    "id": "A77",
    "part": "A",
    "text": "The voltage-gated K+ channel inactivation state is responsible for the absolute refractory period.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The voltage-gated Na+ inactivation state is responsible for the absolute refractory period. K+ voltage-gated channel does not go through any inactivation state."
  },
  {
    "id": "A78",
    "part": "A",
    "text": "The voltage-gated Na+ channel is responsible for the repolarization phase of the action potential.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The repolarization phase of the action potential is due to the opening of the voltage-gated K+ channel."
  },
  {
    "id": "A79",
    "part": "A",
    "text": "Temporal and spatial summation can occur simultaneously.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A80",
    "part": "A",
    "text": "The firing rate influences the amplitude of the resulting action potential in the post-synaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "It can affect the temporal summation and therefore the amplitude of the post-synaptic potentials, not of the action potential."
  },
  {
    "id": "A81",
    "part": "A",
    "text": "The frontal lobe houses the primary visual function.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The primary visual cortex is located in the occipital lobe."
  },
  {
    "id": "A82",
    "part": "A",
    "text": "In the brain primary motor cortex (Penfield homunculus) the extension of the cortical region which controls a specific body region is proportional to that body region's volume.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The extension of the cortical region which controls a specific body region is proportional to the number of motor nerves, not to the body region's volume."
  },
  {
    "id": "A83",
    "part": "A",
    "text": "Ion pumps are based on a passive membrane transportation mechanism.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "They require an energy expenditure by the cell, therefore they are based on an active mechanism."
  },
  {
    "id": "A84",
    "part": "A",
    "text": "Given that at a certain temperature T the Cl- equilibrium potential is equal to -80 mV, and the membrane potential is equal to -70 mV, the Cl- net current will be directed from the inside of the cell toward the outside.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "If the ion equilibrium potential is more negative than the membrane potential, the ion net current will be a hyperpolarizing one. Since Cl- is a negative ion family, its net hyperpolarizing current will be directed from the outside of the cell toward the inside."
  },
  {
    "id": "A85",
    "part": "A",
    "text": "In chemical synapses, when a neurotransmitter opens the K+ gated channels, the resulting PSP is an inhibitory one.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": "K+ gated channels allow the flow of a hyperpolarizing ion current, which in turn produces an inhibitory PSP."
  },
  {
    "id": "A86",
    "part": "A",
    "text": "The continuous conduction is faster than the saltatory (myelinated) one",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The myelinated conduction is faster than the continuous one."
  },
  {
    "id": "A87",
    "part": "A",
    "text": "Two ipsilateral regions belong to the same hemisphere.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A88",
    "part": "A",
    "text": "The unmasking of latent synaptic connections is part of the mechanisms behind brain plasticity.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A89",
    "part": "A",
    "text": "To detect a sequence of action potentials over the axon of a neural cell in vivo, the correct procedure is to record extracellular measures.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A90",
    "part": "A",
    "text": "The cortical pyramidal neurons are oriented tangentially to the cortical surface.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "They are oriented normally to the cortical surface."
  },
  {
    "id": "A91",
    "part": "A",
    "text": "Synchronously activated neurons produce a larger EEG signal than the same amount of neurons when they are asynchronous.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A92",
    "part": "A",
    "text": "In the Nernst equation for the electrochemical equilibrium there is a term referred to diffusional forces and a term referred to electrical forces.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A93",
    "part": "A",
    "text": "Given that at a certain temperature T the Cl- equilibrium potential is equal to -80 mV, and the membrane potential is equal to -70 mV, the Cl- net current will be a depolarizing one.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "If the ion equilibrium potential is more negative than the membrane potential, the ion net current will be a hyperpolarizing one."
  },
  {
    "id": "A94",
    "part": "A",
    "text": "The temporal summation of PSPs does not depend on the temporal distance between subsequent action potentials in the presynaptic cell.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The temporal summation occurs when the presynaptic neuron fires multiple times in close succession."
  },
  {
    "id": "A95",
    "part": "A",
    "text": "A hyperpolarization with respect to the resting membrane potential can cause the generation of an action potential.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "The generation of an action potential is caused by a depolarization of the neuronal membrane."
  },
  {
    "id": "A96",
    "part": "A",
    "text": "The motor homunculus is located in the frontal lobe.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  },
  {
    "id": "A97",
    "part": "A",
    "text": "The short-term synaptic plasticity can involve a structural change in the post-synaptic membrane.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "Structural changes in the post-synaptic membrane occur with long-term plasticity."
  },
  {
    "id": "A98",
    "part": "A",
    "text": "To measure the membrane potential over the soma of a neural cell in vitro, the correct procedure is to record extracellular measures.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "To measure the membrane potential we need intracellular recordings, that can be more easily performed in vitro and on large portions of the cell, like the soma."
  },
  {
    "id": "A99",
    "part": "A",
    "text": "In a cortical pyramidal neuron, thalamo-cortical synapses are located in the apical portion of its dendritic tree.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["False"],
    "explanation": "They are located in the basal part of the dendritic tree."
  },
  {
    "id": "A100",
    "part": "A",
    "text": "Radially symmetric neurons produce a closed field and therefore do not significantly contribute to scalp EEG.",
    "maxScore": 1,
    "type": "TRUE_FALSE",
    "options": ["True", "False"],
    "answer": ["True"],
    "explanation": ""
  }
]